[
    {
        "profile_url": "https://www.linkedin.com/in/uraga-medapati-67975850",
        "name": "uraga medapati 67975850",
        "headline": "Director, IT at Dr. Reddy's Laboratories",
        "location": "Dr. Reddy's Laboratories",
        "summary": "Here is a concise summary of the LinkedIn profile:\n\nUraga Medapati is the Director of IT at Dr. Reddy's Laboratories, based in their location. As a high-level executive, they hold a senior leadership position within the company."
    },
    {
        "profile_url": "https://uk.linkedin.com/in/stewart-tudgay-149bb136",
        "name": "stewart tudgay 149bb136",
        "headline": "Logistic Operations Director at Sprint Logistics Ltd",
        "location": "Sprint Logistics",
        "summary": "Stewart Tudgay is a seasoned professional, currently leading as Logistic Operations Director at Sprint Logistics Ltd. His LinkedIn profile provides a glimpse into his expertise in logistics operations management."
    },
    {
        "profile_url": "https://www.linkedin.com/in/daviddavid",
        "name": "daviddavid",
        "headline": "Creative Leader / Group Creative Director / Writer / Artist",
        "location": "(He/Him)",
        "summary": "Here's a concise summary of the LinkedIn profile:\n\n\"Daviddavid is a versatile creative professional with expertise in leadership, writing, artistry, and more. With a strong background as a Group Creative Director, he brings a unique perspective to his work.\""
    },
    {
        "profile_url": "https://www.linkedin.com/in/michelle-bacon-38492bb",
        "name": "michelle bacon 38492bb",
        "headline": "Senior Counsel, Environmental & Safety Law Group at Chevron",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here's a summary of Michelle Bacon's LinkedIn profile:\n\nMichelle Bacon is a Senior Counsel with expertise in Environmental and Safety Law at Chevron. Her location is listed as \"3rd degree connection\" but appears to be incorrect or incomplete, as the provided information doesn't provide clear clarification.\n\nNote: The unusual \"3rd degree connection\" location might indicate an error or outdated information on Michelle's profile."
    },
    {
        "profile_url": "https://in.linkedin.com/in/rajesh-meiyyappan-b99682142",
        "name": "rajesh meiyyappan b99682142",
        "headline": "Procurement Analyst at Zoho Corporation",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here is a concise summary of the LinkedIn profile:\n\nRajesh Meiyyappan is a Procurement Analyst at Zoho Corporation, with an unclear location due to a third-degree connection issue."
    },
    {
        "profile_url": "https://mx.linkedin.com/in/arturo-marquez-ayala",
        "name": "arturo marquez ayala",
        "headline": "Helping You Navigate Supply Chain Challenges with Strategic 3PL Solutions",
        "location": "(He/Him)",
        "summary": "Arturo Marquez Ayala is a seasoned professional helping clients navigate supply chain challenges through strategic 3PL (Third-Party Logistics) solutions."
    },
    {
        "profile_url": "https://www.linkedin.com/in/craig-ledbetter-aa598132",
        "name": "craig ledbetter aa598132",
        "headline": "SVP, Distribution Operations at Tractor Supply Company",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here's a summary of Craig Ledbetter's LinkedIn profile:\n\nCraig Ledbetter is the Senior Vice President of Distribution Operations at Tractor Supply Company. His exact location is listed as a 3rd-degree connection, implying a private address rather than a specific city or state."
    },
    {
        "profile_url": "https://uk.linkedin.com/in/annaholloway",
        "name": "annaholloway",
        "headline": "E-commerce & Marketing Director. Consultancy & Coaching.",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here's a summary of the LinkedIn profile:\n\nAnnholloway is an E-commerce and Marketing Director with consultancy and coaching expertise, based in the UK (though location seems to be a bit ambiguous)."
    },
    {
        "profile_url": "https://de.linkedin.com/in/stephan-maruschke-198a09275",
        "name": "stephan maruschke 198a09275",
        "headline": "Corporate Director Corporate Governance bei DACHSER Group SE & Co. KG",
        "location": "DACHSER",
        "summary": "Here is a concise summary of the LinkedIn profile:\n\nStephan Maruschke is a Corporate Director at DACHSER Group SE & Co. KG, focusing on corporate governance. His location is listed as DACHSER, suggesting a connection to the company."
    },
    {
        "profile_url": "https://www.linkedin.com/in/carolyngluth",
        "name": "carolyngluth",
        "headline": "Dedicated Public Sector Advocate | Results-Driven Sales Leader | Engaging Public Speaker",
        "location": "Logitech",
        "summary": "Carolly G. Luth is a multifaceted professional with experience in public sector advocacy, sales leadership, and public speaking. Her LinkedIn profile highlights her dedication to driving results in various roles."
    },
    {
        "profile_url": "https://www.linkedin.com/in/juan-valbuena",
        "name": "juan valbuena",
        "headline": "\"Nearshoring Expert | Helping Companies Achieve Peak Performance & Productivity\"",
        "location": "My Near Staff",
        "summary": "Juan Valbuena is a Nearshoring expert helping companies optimize performance and productivity. His LinkedIn profile emphasizes his expertise in this area, with a location listed as \"My Near Staff\", suggesting he works remotely or has a virtual team."
    },
    {
        "profile_url": "https://www.linkedin.com/in/wenbin-jin-pmp-632b0254",
        "name": "wenbin jin pmp 632b0254",
        "headline": "Director, Technical Portfolio and PM Leader in Clinical Manufacturing Operation at Pfizer",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here's a concise summary of Wenbin Jin's LinkedIn profile:\n\nWenbin Jin is a Director at Pfizer, leading clinical manufacturing operations and technical portfolios. His expertise spans pharmaceutical development, with a PMP certification. He has a 3rd-degree connection listed on his location, suggesting an advanced professional network."
    },
    {
        "profile_url": "https://www.linkedin.com/in/alex-krull",
        "name": "alex krull",
        "headline": "Continuous Improvement Manager | Driving Transformational Change Through Cross-Functional Leadership and Innovative Solutions",
        "location": "J.Crew",
        "summary": "Alex Krull is a Continuous Improvement Manager at J.Crew, with expertise in driving transformational change through cross-functional leadership and innovative solutions."
    },
    {
        "profile_url": "https://www.linkedin.com/in/stephanie-christy-350757113",
        "name": "stephanie christy 350757113",
        "headline": "Tug Operator",
        "location": "DHL",
        "summary": "Stephanie Christy is a Tug Operator with a profile at DHL, with a LinkedIn URL provided. Her current title is Tug Operator and location is listed as DHL."
    },
    {
        "profile_url": "https://uk.linkedin.com/in/ryan-carter-",
        "name": "ryan carter ",
        "headline": "Head of IT",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here's a concise summary of Ryan Carter's LinkedIn profile:\n\nRyan Carter is the Head of IT with an impressive yet cryptic location listed as \"3rd degree connection\". Despite the unclear location, his title suggests a senior leadership role in the IT industry."
    },
    {
        "profile_url": "https://www.linkedin.com/in/jackie-njoroge-strategy",
        "name": "jackie njoroge strategy",
        "headline": "Global Business Technology Strategy at Alcon | Ex-BCG",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here is a summary of the LinkedIn profile:\n\nJackie Njoroge is a Global Business Technology Strategist with experience at Alcon and former partner at BCG (Boston Consulting Group). Her location appears to be unverified or jokingly represented as \"3rd degree connection\" which could imply she doesn't want to share her actual location."
    },
    {
        "profile_url": "https://www.linkedin.com/in/tom-melendez-mba",
        "name": "tom melendez mba",
        "headline": "Director of Sales | Sales Leader for award winning teams",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Tom Melendez is a seasoned sales leader with an MBA, currently serving as Director of Sales. He has led award-winning teams and holds a unique connection to the location (3rd degree) that suggests a deep understanding of its nuances."
    },
    {
        "profile_url": "https://www.linkedin.com/in/matthewswaller",
        "name": "matthewswaller",
        "headline": "Director, Corporate Communications, Talent Partnerships & Sports Marketing at Jockey International, Inc.",
        "location": "Jockey International, Inc.",
        "summary": "Matthew Swaller is a Director at Jockey International, Inc., overseeing corporate communications, talent partnerships, and sports marketing."
    },
    {
        "profile_url": "https://www.linkedin.com/in/kristen-weirick",
        "name": "kristen weirick",
        "headline": "Vice President, Global Talent Acquisition and Chief Diversity & Inclusion Officer at Alcon",
        "location": "(She/Her)",
        "summary": "Here's a summary of Kristen Weirick's LinkedIn profile:\n\nKristen Weirick is the Vice President of Global Talent Acquisition and Chief Diversity & Inclusion Officer at Alcon, a leading medical technology company. With her expertise in talent acquisition and diversity & inclusion, she plays a key role in driving business growth while fostering an inclusive workplace culture."
    },
    {
        "profile_url": "https://www.linkedin.com/in/deandunton",
        "name": "deandunton",
        "headline": "Director of Transportation, Last Mile Operations & Analytics",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "DeAndunton is a Director in transportation, focusing on last mile operations and analytics. The LinkedIn profile mentions only two connections, implying the location may be an indirect or third-degree connection rather than a direct one."
    },
    {
        "profile_url": "https://www.linkedin.com/in/ericamhayes",
        "name": "ericamhayes",
        "headline": "Research & Design \\\\ Disabled",
        "location": "(She/Her)",
        "summary": "Ericam Hayes is a disabled individual with expertise in research and design, currently located in the United States (specifically referred to as \"(She/Her)\") with a LinkedIn profile focused on their experiences and career aspirations."
    },
    {
        "profile_url": "https://www.linkedin.com/in/greer-woodruff-4317b7a2",
        "name": "greer woodruff 4317b7a2",
        "headline": "EVP of Safety, Sustainability and Maintenance, JB Hunt Transport, Inc.",
        "location": "3rd degree connection\n      \n\n        3rd",
        "summary": "Here is a concise summary of the LinkedIn profile:\n\nGreer Woodruff is EVP at JB Hunt Transport, Inc., overseeing safety, sustainability, and maintenance."
    },
    {
        "profile_url": "https://uk.linkedin.com/in/aravinth-baskaran",
        "name": "aravinth baskaran",
        "headline": "Lead Data Scientist at The LEGO Group",
        "location": "(He/Him)",
        "summary": "Aravinth Baskaran is a Lead Data Scientist at The LEGO Group, with an active LinkedIn profile showcasing their professional expertise."
    },
    {
        "profile_url": "https://ca.linkedin.com/in/trent-hilhorst-74576544",
        "name": "trent hilhorst 74576544",
        "headline": "Industry Manager - Energy Services, Brenntag Essentials Canada",
        "location": "Brenntag",
        "summary": "Here's a concise summary of the LinkedIn profile:\n\nTrent Hilhorst is an Industry Manager at Brenntag Essentials Canada, specializing in energy services. He is based in \"Brenntag\" (likely a company location)."
    },
    {
        "profile_url": "https://www.linkedin.com/in/catherine-obregon-81a97012a",
        "name": "catherine obregon 81a97012a",
        "headline": "Associate Manager Import Logistics",
        "location": "Wallington, New Jersey, United States",
        "summary": "Here's a concise summary of the LinkedIn profile:\n\nCatherine Obregon is an Associate Manager at Import Logistics with experience in managing import logistics operations. She is based in Wallington, NJ."
    }
]